In [1]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in /opt/conda/lib/python3.10/site-packages (0.5.0)
Requirement already satisfied: sqlalchemy>=2.0 in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (2.0.7)
Requirement already satisfied: ipython in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (8.11.0)
Requirement already satisfied: six in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: prettytable in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (3.7.0)
Requirement already satisfied: ipython-genutils in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlparse in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: typing-extensions>=4.2.0 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: greenlet!=0.4.17 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.2)
Requirement already satisfied: decorator in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.18.2)
Requirement already satisfied: traitlets>=5 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (5.9.0)
Requirement already satisfied: pexpect>4.3 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: matplotlib-inline in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: pygments>=2.4.0 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (2.14.0)
Requirement already satisfied: backcall in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: pickleshare in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: stack-data in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.6.2)
Requirement already satisfied: prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (3.0.38)
Requirement already satisfied: wcwidth in /opt/conda/lib/python3.10/site-packages (from prettytable->ipython-sql) (0.2.6)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /opt/conda/lib/python3.10/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /opt/conda/lib/python3.10/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: pure-eval in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Requirement already satisfied: asttokens>=2.1.0 in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (2.2.1)
Requirement already satisfied: executing>=1.2.0 in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (1.2.0)
WARNING: There was an error checking the latest version of pip.

In [2]:
%load_ext sql

In [3]:
!env | grep POST

POSTGRESQL_USER=reader
POSTGRESQL_PASSWORD=Miba2021

In [4]:
import os
USER = os.environ['POSTGRESQL_USER']
PASSWORD = os.environ['POSTGRESQL_PASSWORD']
POSTGRESQL_HOST = '10.129.0.25'
DBASE_NAME = 'demo'

In [5]:
CONNECT_DATA = 'postgresql://{}:{}@{}/{}'.format(
    USER,
    PASSWORD,
    POSTGRESQL_HOST,
    DBASE_NAME
)

In [6]:
%%sql $CONNECT_DATA
    SELECT * FROM pg_database

4 rows affected.

[(13760, 'postgres', 10, 6, 'en_US.UTF-8', 'en_US.UTF-8', False, True, -1, 13759, '726', '1', 1663, None),
 (1, 'template1', 10, 6, 'en_US.UTF-8', 'en_US.UTF-8', True, True, -1, 13759, '726', '1', 1663, '{=c/postgres,postgres=CTc/postgres}'),
 (13759, 'template0', 10, 6, 'en_US.UTF-8', 'en_US.UTF-8', True, False, -1, 13759, '726', '1', 1663, '{=c/postgres,postgres=CTc/postgres}'),
 (16384, 'demo', 10, 6, 'en_US.UTF-8', 'en_US.UTF-8', False, True, -1, 13759, '726', '1', 1663, '{=Tc/postgres,postgres=CTc/postgres,reader=c/postgres}')]

In [7]:
%sql SELECT tablename AS table FROM pg_tables WHERE tablename !~ '^(pg_|sql_)'

 * postgresql://reader:***@10.129.0.25/demo
8 rows affected.

[('boarding_passes',),
 ('aircrafts_data',),
 ('flights',),
 ('airports_data',),
 ('seats',),
 ('tickets',),
 ('ticket_flights',),
 ('bookings',)]

In [8]:
result = %sql SELECT * FROM seats LIMIT 5

 * postgresql://reader:***@10.129.0.25/demo
5 rows affected.

In [9]:
display(result)

[('319', '2A', 'Business'),
 ('319', '2C', 'Business'),
 ('319', '2D', 'Business'),
 ('319', '2F', 'Business'),
 ('319', '3A', 'Business')]

In [10]:
print(result.keys)

RMKeyView(['aircraft_code', 'seat_no', 'fare_conditions'])

In [11]:
result[0][0]

'319'

In [12]:
import psycopg2

with psycopg2.connect(
    dbname='jovyan'
) as conn:
    with conn.cursor() as cur:
        cur.execute('SELECT datname FROM pg_database')
        records = cur.fetchall()
        
print(records)

[('postgres',), ('jovyan',), ('template1',), ('template0',)]

In [13]:
%%sql postgresql:///jovyan
    SELECT * FROM pg_database

4 rows affected.

[(13761, 'postgres', 10, 6, 'C.UTF-8', 'C.UTF-8', False, True, -1, 13760, '726', '1', 1663, None),
 (16385, 'jovyan', 10, 6, 'C.UTF-8', 'C.UTF-8', False, True, -1, 13760, '726', '1', 1663, None),
 (1, 'template1', 10, 6, 'C.UTF-8', 'C.UTF-8', True, True, -1, 13760, '726', '1', 1663, '{=c/postgres,postgres=CTc/postgres}'),
 (13760, 'template0', 10, 6, 'C.UTF-8', 'C.UTF-8', True, False, -1, 13760, '726', '1', 1663, '{=c/postgres,postgres=CTc/postgres}')]

In [14]:
%%sql postgresql:///jovyan
CREATE TABLE writers (
    first_name text NOT NULL, 
    last_name text NOT NULL, 
    year_of_death text NOT NULL
);
INSERT INTO writers VALUES ('William', 'Shakespeare', '1616');
INSERT INTO writers VALUES ('Bertold', 'Brecht', '1956')

Done.
1 rows affected.
1 rows affected.

[]

In [15]:
%sql SELECT tablename AS table FROM pg_tables WHERE tablename !~ '^(pg_|sql_)'

 * postgresql:///jovyan
   postgresql://reader:***@10.129.0.25/demo
1 rows affected.

[('writers',)]

In [16]:
%sql SELECT * FROM writers

 * postgresql:///jovyan
   postgresql://reader:***@10.129.0.25/demo
2 rows affected.

[('William', 'Shakespeare', '1616'), ('Bertold', 'Brecht', '1956')]

In [17]:
!wget https://edu.postgrespro.com/demo-small-en.zip && unzip -o demo-small-en.zip
!psql -a -f  demo-small-en-20170815.sql
!rm demo-small-en.zip demo-small-en-20170815.sql

--2024-10-31 10:28:59--  https://edu.postgrespro.com/demo-small-en.zip
Resolving edu.postgrespro.com (edu.postgrespro.com)... 213.171.56.196
Connecting to edu.postgrespro.com (edu.postgrespro.com)|213.171.56.196|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 22187739 (21M) [application/zip]
Saving to: ‘demo-small-en.zip’

demo-small-en.zip   100%[===================>]  21.16M  40.7MB/s    in 0.5s

2024-10-31 10:28:59 (40.7 MB/s) - ‘demo-small-en.zip’ saved [22187739/22187739]

Archive:  demo-small-en.zip
  inflating: demo-small-en-20170815.sql
--
-- PostgreSQL database dump
--
-- Dumped from database version 9.6.3
-- Dumped by pg_dump version 9.6.3
SET statement_timeout = 0;
SET
SET lock_timeout = 0;
SET
SET idle_in_transaction_session_timeout = 0;
SET
SET client_encoding = 'UTF8';
SET
SET standard_conforming_strings = on;
SET
SET check_function_bodies = false;
SET
SET client_min_messages = warning;
SET
SET row_security = off;
SET
DROP DATABASE demo;
psql:demo-small-en-20170815.sql:17: ERROR:  database "demo" does not exist
--
-- Name: demo; Type: DATABASE; Schema: -; Owner: -
--
CREATE DATABASE demo;
CREATE DATABASE
\connect demo
You are now connected to database "demo" as user "jovyan".
SET statement_timeout = 0;
SET
SET lock_timeout = 0;
SET
SET idle_in_transaction_session_timeout = 0;
SET
SET client_encoding = 'UTF8';
SET
SET standard_conforming_strings = on;
SET
SET check_function_bodies = false;
SET
SET client_min_messages = warning;
SET
SET row_security = off;
SET
--
-- Name: bookings; Type: SCHEMA; Schema: -; Owner: -
--
CREATE SCHEMA bookings;
CREATE SCHEMA
--
-- Name: SCHEMA bookings; Type: COMMENT; Schema: -; Owner: -
--
COMMENT ON SCHEMA bookings IS 'Airlines demo database schema';
COMMENT
--
-- Name: plpgsql; Type: EXTENSION; Schema: -; Owner: -
--
CREATE EXTENSION IF NOT EXISTS plpgsql WITH SCHEMA pg_catalog;
CREATE EXTENSION
--
-- Name: EXTENSION plpgsql; Type: COMMENT; Schema: -; Owner: -
--
COMMENT ON EXTENSION plpgsql IS 'PL/pgSQL procedural language';
COMMENT
SET search_path = bookings, pg_catalog;
SET
--
-- Name: lang(); Type: FUNCTION; Schema: bookings; Owner: -
--
CREATE FUNCTION lang() RETURNS text
    LANGUAGE plpgsql STABLE
    AS $$
BEGIN
  RETURN current_setting('bookings.lang');
EXCEPTION
  WHEN undefined_object THEN
    RETURN NULL;
END;
$$;
CREATE FUNCTION
--
-- Name: now(); Type: FUNCTION; Schema: bookings; Owner: -
--
CREATE FUNCTION now() RETURNS timestamp with time zone
    LANGUAGE sql IMMUTABLE
    AS $$SELECT '2017-08-15 18:00:00'::TIMESTAMP AT TIME ZONE 'Europe/Moscow';$$;
CREATE FUNCTION
--
-- Name: FUNCTION now(); Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON FUNCTION now() IS 'Point in time according to which the data are generated';
COMMENT
SET default_tablespace = '';
SET
SET default_with_oids = false;
SET
--
-- Name: aircrafts_data; Type: TABLE; Schema: bookings; Owner: -
--
CREATE TABLE aircrafts_data (
    aircraft_code character(3) NOT NULL,
    model jsonb NOT NULL,
    range integer NOT NULL,
    CONSTRAINT aircrafts_range_check CHECK ((range > 0))
);
CREATE TABLE
--
-- Name: TABLE aircrafts_data; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON TABLE aircrafts_data IS 'Aircrafts (internal data)';
COMMENT
--
-- Name: COLUMN aircrafts_data.aircraft_code; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN aircrafts_data.aircraft_code IS 'Aircraft code, IATA';
COMMENT
--
-- Name: COLUMN aircrafts_data.model; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN aircrafts_data.model IS 'Aircraft model';
COMMENT
--
-- Name: COLUMN aircrafts_data.range; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN aircrafts_data.range IS 'Maximal flying distance, km';
COMMENT
--
-- Name: aircrafts; Type: VIEW; Schema: bookings; Owner: -
--
CREATE VIEW aircrafts AS
 SELECT ml.aircraft_code,
    (ml.model ->> lang()) AS model,
    ml.range
   FROM aircrafts_data ml;
CREATE VIEW
--
-- Name: VIEW aircrafts; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON VIEW aircrafts IS 'Aircrafts';
COMMENT
--
-- Name: COLUMN aircrafts.aircraft_code; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN aircrafts.aircraft_code IS 'Aircraft code, IATA';
COMMENT
--
-- Name: COLUMN aircrafts.model; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN aircrafts.model IS 'Aircraft model';
COMMENT
--
-- Name: COLUMN aircrafts.range; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN aircrafts.range IS 'Maximal flying distance, km';
COMMENT
--
-- Name: airports_data; Type: TABLE; Schema: bookings; Owner: -
--
CREATE TABLE airports_data (
    airport_code character(3) NOT NULL,
    airport_name jsonb NOT NULL,
    city jsonb NOT NULL,
    coordinates point NOT NULL,
    timezone text NOT NULL
);
CREATE TABLE
--
-- Name: TABLE airports_data; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON TABLE airports_data IS 'Airports (internal data)';
COMMENT
--
-- Name: COLUMN airports_data.airport_code; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN airports_data.airport_code IS 'Airport code';
COMMENT
--
-- Name: COLUMN airports_data.airport_name; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN airports_data.airport_name IS 'Airport name';
COMMENT
--
-- Name: COLUMN airports_data.city; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN airports_data.city IS 'City';
COMMENT
--
-- Name: COLUMN airports_data.coordinates; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN airports_data.coordinates IS 'Airport coordinates (longitude and latitude)';
COMMENT
--
-- Name: COLUMN airports_data.timezone; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN airports_data.timezone IS 'Airport time zone';
COMMENT
--
-- Name: airports; Type: VIEW; Schema: bookings; Owner: -
--
CREATE VIEW airports AS
 SELECT ml.airport_code,
    (ml.airport_name ->> lang()) AS airport_name,
    (ml.city ->> lang()) AS city,
    ml.coordinates,
    ml.timezone
   FROM airports_data ml;
CREATE VIEW
--
-- Name: VIEW airports; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON VIEW airports IS 'Airports';
COMMENT
--
-- Name: COLUMN airports.airport_code; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN airports.airport_code IS 'Airport code';
COMMENT
--
-- Name: COLUMN airports.airport_name; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN airports.airport_name IS 'Airport name';
COMMENT
--
-- Name: COLUMN airports.city; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN airports.city IS 'City';
COMMENT
--
-- Name: COLUMN airports.coordinates; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN airports.coordinates IS 'Airport coordinates (longitude and latitude)';
COMMENT
--
-- Name: COLUMN airports.timezone; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN airports.timezone IS 'Airport time zone';
COMMENT
--
-- Name: boarding_passes; Type: TABLE; Schema: bookings; Owner: -
--
CREATE TABLE boarding_passes (
    ticket_no character(13) NOT NULL,
    flight_id integer NOT NULL,
    boarding_no integer NOT NULL,
    seat_no character varying(4) NOT NULL
);
CREATE TABLE
--
-- Name: TABLE boarding_passes; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON TABLE boarding_passes IS 'Boarding passes';
COMMENT
--
-- Name: COLUMN boarding_passes.ticket_no; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN boarding_passes.ticket_no IS 'Ticket number';
COMMENT
--
-- Name: COLUMN boarding_passes.flight_id; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN boarding_passes.flight_id IS 'Flight ID';
COMMENT
--
-- Name: COLUMN boarding_passes.boarding_no; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN boarding_passes.boarding_no IS 'Boarding pass number';
COMMENT
--
-- Name: COLUMN boarding_passes.seat_no; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN boarding_passes.seat_no IS 'Seat number';
COMMENT
--
-- Name: bookings; Type: TABLE; Schema: bookings; Owner: -
--
CREATE TABLE bookings (
    book_ref character(6) NOT NULL,
    book_date timestamp with time zone NOT NULL,
    total_amount numeric(10,2) NOT NULL
);
CREATE TABLE
--
-- Name: TABLE bookings; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON TABLE bookings IS 'Bookings';
COMMENT
--
-- Name: COLUMN bookings.book_ref; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN bookings.book_ref IS 'Booking number';
COMMENT
--
-- Name: COLUMN bookings.book_date; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN bookings.book_date IS 'Booking date';
COMMENT
--
-- Name: COLUMN bookings.total_amount; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN bookings.total_amount IS 'Total booking cost';
COMMENT
--
-- Name: flights; Type: TABLE; Schema: bookings; Owner: -
--
CREATE TABLE flights (
    flight_id integer NOT NULL,
    flight_no character(6) NOT NULL,
    scheduled_departure timestamp with time zone NOT NULL,
    scheduled_arrival timestamp with time zone NOT NULL,
    departure_airport character(3) NOT NULL,
    arrival_airport character(3) NOT NULL,
    status character varying(20) NOT NULL,
    aircraft_code character(3) NOT NULL,
    actual_departure timestamp with time zone,
    actual_arrival timestamp with time zone,
    CONSTRAINT flights_check CHECK ((scheduled_arrival > scheduled_departure)),
    CONSTRAINT flights_check1 CHECK (((actual_arrival IS NULL) OR ((actual_departure IS NOT NULL) AND (actual_arrival IS NOT NULL) AND (actual_arrival > actual_departure)))),
    CONSTRAINT flights_status_check CHECK (((status)::text = ANY (ARRAY[('On Time'::character varying)::text, ('Delayed'::character varying)::text, ('Departed'::character varying)::text, ('Arrived'::character varying)::text, ('Scheduled'::character varying)::text, ('Cancelled'::character varying)::text])))
);
CREATE TABLE
--
-- Name: TABLE flights; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON TABLE flights IS 'Flights';
COMMENT
--
-- Name: COLUMN flights.flight_id; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN flights.flight_id IS 'Flight ID';
COMMENT
--
-- Name: COLUMN flights.flight_no; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN flights.flight_no IS 'Flight number';
COMMENT
--
-- Name: COLUMN flights.scheduled_departure; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN flights.scheduled_departure IS 'Scheduled departure time';
COMMENT
--
-- Name: COLUMN flights.scheduled_arrival; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN flights.scheduled_arrival IS 'Scheduled arrival time';
COMMENT
--
-- Name: COLUMN flights.departure_airport; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN flights.departure_airport IS 'Airport of departure';
COMMENT
--
-- Name: COLUMN flights.arrival_airport; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN flights.arrival_airport IS 'Airport of arrival';
COMMENT
--
-- Name: COLUMN flights.status; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN flights.status IS 'Flight status';
COMMENT
--
-- Name: COLUMN flights.aircraft_code; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN flights.aircraft_code IS 'Aircraft code, IATA';
COMMENT
--
-- Name: COLUMN flights.actual_departure; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN flights.actual_departure IS 'Actual departure time';
COMMENT
--
-- Name: COLUMN flights.actual_arrival; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN flights.actual_arrival IS 'Actual arrival time';
COMMENT
--
-- Name: flights_flight_id_seq; Type: SEQUENCE; Schema: bookings; Owner: -
--
CREATE SEQUENCE flights_flight_id_seq
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;
CREATE SEQUENCE
--
-- Name: flights_flight_id_seq; Type: SEQUENCE OWNED BY; Schema: bookings; Owner: -
--
ALTER SEQUENCE flights_flight_id_seq OWNED BY flights.flight_id;
ALTER SEQUENCE
--
-- Name: flights_v; Type: VIEW; Schema: bookings; Owner: -
--
CREATE VIEW flights_v AS
 SELECT f.flight_id,
    f.flight_no,
    f.scheduled_departure,
    timezone(dep.timezone, f.scheduled_departure) AS scheduled_departure_local,
    f.scheduled_arrival,
    timezone(arr.timezone, f.scheduled_arrival) AS scheduled_arrival_local,
    (f.scheduled_arrival - f.scheduled_departure) AS scheduled_duration,
    f.departure_airport,
    dep.airport_name AS departure_airport_name,
    dep.city AS departure_city,
    f.arrival_airport,
    arr.airport_name AS arrival_airport_name,
    arr.city AS arrival_city,
    f.status,
    f.aircraft_code,
    f.actual_departure,
    timezone(dep.timezone, f.actual_departure) AS actual_departure_local,
    f.actual_arrival,
    timezone(arr.timezone, f.actual_arrival) AS actual_arrival_local,
    (f.actual_arrival - f.actual_departure) AS actual_duration
   FROM flights f,
    airports dep,
    airports arr
  WHERE ((f.departure_airport = dep.airport_code) AND (f.arrival_airport = arr.airport_code));
CREATE VIEW
--
-- Name: VIEW flights_v; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON VIEW flights_v IS 'Flights (extended)';
COMMENT
--
-- Name: COLUMN flights_v.flight_id; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN flights_v.flight_id IS 'Flight ID';
COMMENT
--
-- Name: COLUMN flights_v.flight_no; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN flights_v.flight_no IS 'Flight number';
COMMENT
--
-- Name: COLUMN flights_v.scheduled_departure; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN flights_v.scheduled_departure IS 'Scheduled departure time';
COMMENT
--
-- Name: COLUMN flights_v.scheduled_departure_local; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN flights_v.scheduled_departure_local IS 'Scheduled departure time, local time at the point of departure';
COMMENT
--
-- Name: COLUMN flights_v.scheduled_arrival; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN flights_v.scheduled_arrival IS 'Scheduled arrival time';
COMMENT
--
-- Name: COLUMN flights_v.scheduled_arrival_local; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN flights_v.scheduled_arrival_local IS 'Scheduled arrival time, local time at the point of destination';
COMMENT
--
-- Name: COLUMN flights_v.scheduled_duration; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN flights_v.scheduled_duration IS 'Scheduled flight duration';
COMMENT
--
-- Name: COLUMN flights_v.departure_airport; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN flights_v.departure_airport IS 'Deprature airport code';
COMMENT
--
-- Name: COLUMN flights_v.departure_airport_name; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN flights_v.departure_airport_name IS 'Departure airport name';
COMMENT
--
-- Name: COLUMN flights_v.departure_city; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN flights_v.departure_city IS 'City of departure';
COMMENT
--
-- Name: COLUMN flights_v.arrival_airport; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN flights_v.arrival_airport IS 'Arrival airport code';
COMMENT
--
-- Name: COLUMN flights_v.arrival_airport_name; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN flights_v.arrival_airport_name IS 'Arrival airport name';
COMMENT
--
-- Name: COLUMN flights_v.arrival_city; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN flights_v.arrival_city IS 'City of arrival';
COMMENT
--
-- Name: COLUMN flights_v.status; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN flights_v.status IS 'Flight status';
COMMENT
--
-- Name: COLUMN flights_v.aircraft_code; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN flights_v.aircraft_code IS 'Aircraft code, IATA';
COMMENT
--
-- Name: COLUMN flights_v.actual_departure; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN flights_v.actual_departure IS 'Actual departure time';
COMMENT
--
-- Name: COLUMN flights_v.actual_departure_local; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN flights_v.actual_departure_local IS 'Actual departure time, local time at the point of departure';
COMMENT
--
-- Name: COLUMN flights_v.actual_arrival; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN flights_v.actual_arrival IS 'Actual arrival time';
COMMENT
--
-- Name: COLUMN flights_v.actual_arrival_local; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN flights_v.actual_arrival_local IS 'Actual arrival time, local time at the point of destination';
COMMENT
--
-- Name: COLUMN flights_v.actual_duration; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN flights_v.actual_duration IS 'Actual flight duration';
COMMENT
--
-- Name: routes; Type: VIEW; Schema: bookings; Owner: -
--
CREATE VIEW routes AS
 WITH f3 AS (
         SELECT f2.flight_no,
            f2.departure_airport,
            f2.arrival_airport,
            f2.aircraft_code,
            f2.duration,
            array_agg(f2.days_of_week) AS days_of_week
           FROM ( SELECT f1.flight_no,
                    f1.departure_airport,
                    f1.arrival_airport,
                    f1.aircraft_code,
                    f1.duration,
                    f1.days_of_week
                   FROM ( SELECT flights.flight_no,
                            flights.departure_airport,
                            flights.arrival_airport,
                            flights.aircraft_code,
                            (flights.scheduled_arrival - flights.scheduled_departure) AS duration,
                            (to_char(flights.scheduled_departure, 'ID'::text))::integer AS days_of_week
                           FROM flights) f1
                  GROUP BY f1.flight_no, f1.departure_airport, f1.arrival_airport, f1.aircraft_code, f1.duration, f1.days_of_week
                  ORDER BY f1.flight_no, f1.departure_airport, f1.arrival_airport, f1.aircraft_code, f1.duration, f1.days_of_week) f2
          GROUP BY f2.flight_no, f2.departure_airport, f2.arrival_airport, f2.aircraft_code, f2.duration
        )
 SELECT f3.flight_no,
    f3.departure_airport,
    dep.airport_name AS departure_airport_name,
    dep.city AS departure_city,
    f3.arrival_airport,
    arr.airport_name AS arrival_airport_name,
    arr.city AS arrival_city,
    f3.aircraft_code,
    f3.duration,
    f3.days_of_week
   FROM f3,
    airports dep,
    airports arr
  WHERE ((f3.departure_airport = dep.airport_code) AND (f3.arrival_airport = arr.airport_code));
CREATE VIEW
--
-- Name: VIEW routes; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON VIEW routes IS 'Routes';
COMMENT
--
-- Name: COLUMN routes.flight_no; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN routes.flight_no IS 'Flight number';
COMMENT
--
-- Name: COLUMN routes.departure_airport; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN routes.departure_airport IS 'Code of airport of departure';
COMMENT
--
-- Name: COLUMN routes.departure_airport_name; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN routes.departure_airport_name IS 'Name of airport of departure';
COMMENT
--
-- Name: COLUMN routes.departure_city; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN routes.departure_city IS 'City of departure';
COMMENT
--
-- Name: COLUMN routes.arrival_airport; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN routes.arrival_airport IS 'Code of airport of arrival';
COMMENT
--
-- Name: COLUMN routes.arrival_airport_name; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN routes.arrival_airport_name IS 'Name of airport of arrival';
COMMENT
--
-- Name: COLUMN routes.arrival_city; Type: COMMENT; Schema: bookings; Owner: -
--
COMMENT ON COLUMN routes.arrival_city IS 'City of arrival';
COMMENT
--

In [18]:
%%sql postgresql:///demo
    SELECT * FROM pg_database

5 rows affected.

[(13761, 'postgres', 10, 6, 'C.UTF-8', 'C.UTF-8', False, True, -1, 13760, '726', '1', 1663, None),
 (16385, 'jovyan', 10, 6, 'C.UTF-8', 'C.UTF-8', False, True, -1, 13760, '726', '1', 1663, None),
 (1, 'template1', 10, 6, 'C.UTF-8', 'C.UTF-8', True, True, -1, 13760, '726', '1', 1663, '{=c/postgres,postgres=CTc/postgres}'),
 (13760, 'template0', 10, 6, 'C.UTF-8', 'C.UTF-8', True, False, -1, 13760, '726', '1', 1663, '{=c/postgres,postgres=CTc/postgres}'),
 (24581, 'demo', 16384, 6, 'C.UTF-8', 'C.UTF-8', False, True, -1, 13760, '726', '1', 1663, None)]

In [19]:
%sql SELECT * FROM seats LIMIT 5

 * postgresql:///demo
   postgresql:///jovyan
   postgresql://reader:***@10.129.0.25/demo
5 rows affected.

[('319', '2A', 'Business'),
 ('319', '2C', 'Business'),
 ('319', '2D', 'Business'),
 ('319', '2F', 'Business'),
 ('319', '3A', 'Business')]

In [23]:
import os
import psycopg2

In [28]:
!pip install ipython-sql
%load_ext sql

Requirement already satisfied: ipython-sql in /opt/conda/lib/python3.10/site-packages (0.5.0)
Requirement already satisfied: prettytable in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (3.7.0)
Requirement already satisfied: sqlalchemy>=2.0 in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (2.0.7)
Requirement already satisfied: ipython-genutils in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: six in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (8.11.0)
Requirement already satisfied: sqlparse in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: typing-extensions>=4.2.0 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: greenlet!=0.4.17 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.2)
Requirement already satisfied: jedi>=0.16 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.18.2)
Requirement already satisfied: pygments>=2.4.0 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (2.14.0)
Requirement already satisfied: pickleshare in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: pexpect>4.3 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (3.0.38)
Requirement already satisfied: stack-data in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.6.2)
Requirement already satisfied: backcall in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: traitlets>=5 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (5.9.0)
Requirement already satisfied: decorator in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: wcwidth in /opt/conda/lib/python3.10/site-packages (from prettytable->ipython-sql) (0.2.6)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /opt/conda/lib/python3.10/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /opt/conda/lib/python3.10/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: pure-eval in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Requirement already satisfied: executing>=1.2.0 in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (1.2.0)
Requirement already satisfied: asttokens>=2.1.0 in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (2.2.1)
WARNING: There was an error checking the latest version of pip.
The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [29]:
import os

USER = os.environ['POSTGRESQL_USER']
PASSWORD = os.environ['POSTGRESQL_PASSWORD']
POSTGRESQL_HOST = '10.129.0.25'
DBASE_NAME = 'demo'

CONNECT_DATA = 'postgresql://{}:{}@{}/{}'.format(
    USER,
    PASSWORD,
    POSTGRESQL_HOST,
    DBASE_NAME
)

In [38]:
with psycopg2. connect (
    dbname= ' demo'
    user=os environ ['POSTGRESQL_USER'],
    password=os. environ ['POSTGRESQL_PASSWORD'] ,
    host=POSTGRESQL _HOST
) as conn:
    with conn. cursor) as cur:
        cur execute ("SELECT passenger_id, passenger_name FROM Tickets WHEREL
-ticket_no = '0005432312164'")
                     passenger = cur. fetchall()

SyntaxError: unmatched ')' (91643435.py, line 7)